; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v7 ?v4)
		(pred_2 ?v5)
		(pred_1 ?v1)
		(pred_4 ?v1)
		(pred_5 ?v5 ?v1)
		(pred_6)
		(pred_3 ?v5))

   (:action op_1
       :parameters  (?v6 ?v2)
       :precondition (and (not-eq ?v6 ?v2) 
                          (pred_1 ?v6) (pred_1 ?v2) (pred_4 ?v6))
       :effect (and  (pred_4 ?v2)
		     (not (pred_4 ?v6))))


   (:action op_3
       :parameters (?v8 ?v3)
       :precondition  (and  (pred_2 ?v8) (pred_1 ?v3)
			    (pred_5 ?v8 ?v3) (pred_4 ?v3) (pred_6))
       :effect (and (pred_3 ?v8)
		    (not (pred_5 ?v8 ?v3)) 
		    (not (pred_6))))

   (:action op_2
       :parameters  (?v8  ?v3)
       :precondition  (and  (pred_2 ?v8) (pred_1 ?v3)
			    (pred_3 ?v8) (pred_4 ?v3))
       :effect (and (pred_5 ?v8 ?v3)
		    (pred_6)
		    (not (pred_3 ?v8)))))

; problem
(define (problem ferry-l6-c2)
(:domain ferry)
(:objects obj_02 obj_01 obj_04 obj_03 obj_05 obj_06 
          obj_07 obj_08 
)
(:init
(pred_1 obj_02)
(pred_1 obj_01)
(pred_1 obj_04)
(pred_1 obj_03)
(pred_1 obj_05)
(pred_1 obj_06)
(pred_2 obj_07)
(pred_2 obj_08)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_02)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_03)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_05)
(pred_6)
(pred_5 obj_07 obj_01)
(pred_5 obj_08 obj_06)
(pred_4 obj_05)
)
(:goal
(and
(pred_5 obj_07 obj_04)
(pred_5 obj_08 obj_06)
)
)

(:constraints
  (sometime-before  (pred_5 obj_07 obj_04) (pred_4 obj_02))
)
)

; plan
1. (op_1 obj_05 obj_01)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_01)
   goals met: 1 of 2
2. (op_3 obj_07 obj_01)
   deleted: (pred_5 obj_07 obj_01) (pred_6)
   added: (pred_3 obj_07)
   goals met: 1 of 2
3. (op_1 obj_01 obj_06)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_06)
   goals met: 1 of 2
4. (op_2 obj_07 obj_06)
   deleted: (pred_3 obj_07)
   added: (pred_5 obj_07 obj_06) (pred_6)
   goals met: 1 of 2
5. (op_3 obj_08 obj_06)
   deleted: (pred_5 obj_08 obj_06) (pred_6)
   added: (pred_3 obj_08)
   goals met: 0 of 2
6. (op_1 obj_06 obj_02)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_02)
   goals met: 0 of 2
7. (op_2 obj_08 obj_02)
   deleted: (pred_3 obj_08)
   added: (pred_5 obj_08 obj_02) (pred_6)
   goals met: 0 of 2
8. (op_1 obj_02 obj_06)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_06)
   goals met: 0 of 2
9. (op_3 obj_07 obj_06)
   deleted: (pred_5 obj_07 obj_06) (pred_6)
   added: (pred_3 obj_07)
   goals met: 0 of 2
10. (op_1 obj_06 obj_04)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_04)
   goals met: 0 of 2
11. (op_2 obj_07 obj_04)
   deleted: (pred_3 obj_07)
   added: (pred_5 obj_07 obj_04) (pred_6)
   goals met: 1 of 2
12. (op_1 obj_04 obj_02)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_02)
   goals met: 1 of 2
13. (op_3 obj_08 obj_02)
   deleted: (pred_5 obj_08 obj_02) (pred_6)
   added: (pred_3 obj_08)
   goals met: 1 of 2
14. (op_1 obj_02 obj_06)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_06)
   goals met: 1 of 2
15. (op_2 obj_08 obj_06)
   deleted: (pred_3 obj_08)
   added: (pred_5 obj_08 obj_06) (pred_6)
   goals met: 2 of 2
